Revit 2027 API
BuiltInFailures.GroupFailures.GroupsHasCycle Property
 Can't create Group because it contains multiple copies of same Group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GroupsHasCycle { get; }
Public Shared ReadOnly Property GroupsHasCycle As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GroupsHasCycle {
	FailureDefinitionId^ get ();
}
static member GroupsHasCycle : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace